In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("komek-kayit-sayilari-eski.csv")

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   yil              18 non-null     object
 1   kursiyer_sayisi  18 non-null     int64
dtypes: int64(1), object(1)
memory usage: 420.0+ bytes

In [4]:
data

           yil  kursiyer_sayisi
0   2004-01-01             3801
1   2005-01-01             5558
2   2006-01-01            12837
3   2007-01-01            16634
4   2008-01-01            18304
5   2009-01-01            14703
6   2010-01-01            15532
7   2011-01-01            25426
8   2012-01-01            29195
9   2013-01-01            36779
10  2014-01-01            56972
11  2015-01-01            80099
12  2016-01-01            95384
13  2017-01-01           100903
14  2018-01-01           142424
15  2019-01-01           152025
16  2020-01-01            93017
17  2021-01-01            13994

In [5]:
data.rename(columns={"yil" : "baslangic_tarihi"}, inplace=True)

In [6]:
data["baslangic_tarihi"] = pd.to_datetime(data["baslangic_tarihi"], format= "%Y-%m-%d")

In [7]:
data.head()

  baslangic_tarihi  kursiyer_sayisi
0       2004-01-01             3801
1       2005-01-01             5558
2       2006-01-01            12837
3       2007-01-01            16634
4       2008-01-01            18304

In [8]:
data["bitis_tarihi"] = data["baslangic_tarihi"].copy()

In [9]:
data["bitis_tarihi"] = data["bitis_tarihi"].astype(str)

In [10]:
data

   baslangic_tarihi  kursiyer_sayisi bitis_tarihi
0        2004-01-01             3801   2004-01-01
1        2005-01-01             5558   2005-01-01
2        2006-01-01            12837   2006-01-01
3        2007-01-01            16634   2007-01-01
4        2008-01-01            18304   2008-01-01
5        2009-01-01            14703   2009-01-01
6        2010-01-01            15532   2010-01-01
7        2011-01-01            25426   2011-01-01
8        2012-01-01            29195   2012-01-01
9        2013-01-01            36779   2013-01-01
10       2014-01-01            56972   2014-01-01
11       2015-01-01            80099   2015-01-01
12       2016-01-01            95384   2016-01-01
13       2017-01-01           100903   2017-01-01
14       2018-01-01           142424   2018-01-01
15       2019-01-01           152025   2019-01-01
16       2020-01-01            93017   2020-01-01
17       2021-01-01            13994   2021-01-01

In [11]:
data["bitis_tarihi"] = data["bitis_tarihi"].apply(lambda x: x[:-5] + "12-31")

In [12]:
data

   baslangic_tarihi  kursiyer_sayisi bitis_tarihi
0        2004-01-01             3801   2004-12-31
1        2005-01-01             5558   2005-12-31
2        2006-01-01            12837   2006-12-31
3        2007-01-01            16634   2007-12-31
4        2008-01-01            18304   2008-12-31
5        2009-01-01            14703   2009-12-31
6        2010-01-01            15532   2010-12-31
7        2011-01-01            25426   2011-12-31
8        2012-01-01            29195   2012-12-31
9        2013-01-01            36779   2013-12-31
10       2014-01-01            56972   2014-12-31
11       2015-01-01            80099   2015-12-31
12       2016-01-01            95384   2016-12-31
13       2017-01-01           100903   2017-12-31
14       2018-01-01           142424   2018-12-31
15       2019-01-01           152025   2019-12-31
16       2020-01-01            93017   2020-12-31
17       2021-01-01            13994   2021-12-31

In [13]:
yeni_sutunlar = ["baslangic_tarihi", "bitis_tarihi", "kursiyer_sayisi"]

In [14]:
data = data[yeni_sutunlar]

In [15]:
data["baslangic_tarihi"] = pd.to_datetime(data["baslangic_tarihi"], format= "%Y-%m-%d")
data["bitis_tarihi"] = pd.to_datetime(data["bitis_tarihi"], format= "%Y-%m-%d")

In [16]:
type(data["bitis_tarihi"][0])
type(data["baslangic_tarihi"][0])

pandas._libs.tslibs.timestamps.Timestamp

In [17]:
data

   baslangic_tarihi bitis_tarihi  kursiyer_sayisi
0        2004-01-01   2004-12-31             3801
1        2005-01-01   2005-12-31             5558
2        2006-01-01   2006-12-31            12837
3        2007-01-01   2007-12-31            16634
4        2008-01-01   2008-12-31            18304
5        2009-01-01   2009-12-31            14703
6        2010-01-01   2010-12-31            15532
7        2011-01-01   2011-12-31            25426
8        2012-01-01   2012-12-31            29195
9        2013-01-01   2013-12-31            36779
10       2014-01-01   2014-12-31            56972
11       2015-01-01   2015-12-31            80099
12       2016-01-01   2016-12-31            95384
13       2017-01-01   2017-12-31           100903
14       2018-01-01   2018-12-31           142424
15       2019-01-01   2019-12-31           152025
16       2020-01-01   2020-12-31            93017
17       2021-01-01   2021-12-31            13994

In [18]:
data.to_csv("/Users/o/Desktop/acik-veri-calismalari/komek-kayit-sayilari-temiz/komek-kayit-sayilari.csv" , index=False ,header=True)
data.to_excel("/Users/o/Desktop/acik-veri-calismalari/komek-kayit-sayilari-temiz/komek-kayit-sayilari.xlsx" , index=False ,header=True)